InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиПользователей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Процедура СкопироватьНастройки(ПользовательИсточник, ПользователиПриемник, МассивНастроекДляКопирования) Экспорт
	
	ИдентификаторыНастроекДляКопирования = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивНастроекДляКопирования, "Идентификатор");
	СтрокаНастроекДляКопирования = "";
	Разделитель = ",";	
	Для Каждого Элемент Из ИдентификаторыНастроекДляКопирования Цикл
		
		СимволРазделителя = ?(ПустаяСтрока(СтрокаНастроекДляКопирования), "", Разделитель);
		
		СтрокаНастроекДляКопирования = СтрокаНастроекДляКопирования + СимволРазделителя + Элемент.Значение;
		
	КонецЦикла;
	
	ЗначенияНастроекПользователя = ПользователиБКВызовСервераПовтИсп.ЗначенияНастроекПользователя(ПользовательИсточник, СтрокаНастроекДляКопирования);
	Для Каждого ПользовательПриемник Из ПользователиПриемник Цикл
		
		НаборЗаписей = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Пользователь.Использование = Истина;
		НаборЗаписей.Отбор.Пользователь.Значение      = ПользовательПриемник;
		
		НаборЗаписей.Отбор.Настройка.Использование = Истина;
		
		Для Каждого Настройка Из МассивНастроекДляКопирования Цикл
			
			НаборЗаписей.Отбор.Настройка.Значение  = Настройка;
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() = 0 Тогда
				Запись = НаборЗаписей.Добавить();
				Запись.Пользователь = ПользовательПриемник;
				Запись.Настройка    = Настройка;
				Запись.Значение     = Настройка.ТипЗначения.ПривестиЗначение(ЗначенияНастроекПользователя[Настройка.Идентификатор]);
			Иначе
				Запись = НаборЗаписей.Получить(0);
				Запись.Значение     = Настройка.ТипЗначения.ПривестиЗначение(ЗначенияНастроекПользователя[Настройка.Идентификатор]);
			КонецЕсли;
			
			НаборЗаписей.Записать();
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#КонецЕсли
